tutorials/rhoSonicFoam/shockTube/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/dm2/henry/OpenFOAM/OpenFOAM-1.4.1/tutorials/rhoSonicFoam";
    case "shockTube";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
sides
{
    type patch;
    physicalType extrapolatedOutlet;
    nFaces 2;
    startFace 999;
}

empty
{
    type empty;
    physicalType empty;
    nFaces 4000;
    startFace 1001;
}
)

// ************************************************************************* //
