tutorials/rhoSonicFoam/shockTube/system/sampleDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


interpolationScheme cellPoint;

writeFormat     raw;

sampleSets      
(
    uniform
    {
        name            data;
        axis            x;
        start           (-4.995 0 0);
        end             (4.995  0 0);
        nPoints         1000;
    }
);

fields          
(
    T
    magU
    p
);


// ************************************************************************* //
